<center>
    This is Set 7: Multiple Frames (Exercises 61-70)
</center>

**Prerequisites**
* The sample dataset [datatableton_sample.zip](https://github.com/vopani/datatableton/blob/main/data/datatableton_sample.zip) will be used for the exercises.

In [1]:
import pandas as pd
from zipfile import ZipFile
import numpy as np

**Exercise 61: Read all the files together from `datatableton_sample.zip`, assign the list of frames to `data` and print the name of each file**

In [2]:
zip_file = ZipFile('datatableton_sample.zip')
data = []
for file in zip_file.filelist:
    if 'MACOS' not in file.filename:
        print(file.filename)
        data.append(pd.read_csv(zip_file.open(file.filename)))

orders_feb.csv
orders_jan.csv
orders_mar.csv
returns.csv
users.csv

**Exercise 62: Assign the frames `orders_jan.csv`, `orders_feb.csv`, `orders_mar.csv`, `returns.csv` and `users.csv` in `data` to individual frames `orders_jan`, `orders_feb`, `orders_mar`, `returns` and `users` respectively and display the head of each frame**

In [3]:
orders_feb, orders_jan, orders_mar, returns, users = data

In [4]:
orders_jan.head()

   Order ID     Category  Category ID   Sales  Quantity  Discount Month
0       1.1     Apparels         1001   89.00         2       0.2   Jan
1       1.2  Electronics         1003   65.00        87       0.2   Jan
2       1.3    Cosmetics         1002  272.74         3       0.2   Jan
3       1.4     Apparels         1001    3.54         2       0.8   Jan
4       1.5    Cosmetics         1002   19.54         3       0.2   Jan

In [5]:
orders_feb.head()

,Order ID,Category,Category ID,Sales,Quantity,Discount,Month
0,2.1,Flowers,1004,75,15,0.2,Feb
1,2.2,International Cuisine,1005,65,23,0.2,Feb
2,2.3,Paper Products,1006,115,100,0.8,Feb
3,2.4,Gift cards,1005,236,565,0.2,Feb
4,2.5,Pet Care,1007,78,8,0.0,Feb

In [6]:
orders_mar.head()

,Order ID,Category,Category ID,Sales,Quantity,Discount,Month
0,3.1,Flowers,1004,32.0,45,0.3,March
1,3.2,International Cuisine,1005,160.0,4,0.2,March
2,3.3,Pet Care,1009,130.0,89,0.3,March
3,3.4,International Cuisine,1005,3.5,12,0.9,March
4,3.5,Paper Products,1006,35.0,4,0.2,March

In [7]:
returns.head()

   Number of Records  Order ID         Updated Order Returns Return ID
0                  1       1.1                    Inaccurate      R001
1                 10       1.2                 Late Delivery      R002
2                  1       1.3               Product Damaged      R003
3                  1       1.4  Incorrect Products Delivered      R004
4                  8       1.5        Description Inaccurate      R005

In [8]:
users.head()

     Person  Category ID Return ID   Region
0       Amy         1001      R004     West
1       Max         1002      R001     East
2   William         1007      R003  Central
3     Nancy         1004      R006    South
4  Isabella         1001      R006     West

**Exercise 63: Append all rows of `orders_jan`, `orders_feb` and `orders_mar` into a single frame and assign it to `orders_all`**

In [9]:
orders_all = pd.concat([orders_jan, orders_feb, orders_mar])
orders_all.head(10)

   Order ID     Category  Category ID    Sales  Quantity  Discount Month
0       1.1     Apparels         1001    89.00         2       0.2   Jan
1       1.2  Electronics         1003    65.00        87       0.2   Jan
2       1.3    Cosmetics         1002   272.74         3       0.2   Jan
3       1.4     Apparels         1001     3.54         2       0.8   Jan
4       1.5    Cosmetics         1002    19.54         3       0.2   Jan
5       1.6  Electronics         1003    19.44         3       0.0   Jan
6       1.7     Apparels         1001    12.78         3       0.0   Jan
7       1.8     Apparels         1001  2573.82         9       0.0   Jan
8       1.9     Apparels         1001   300.00        10       0.5   Jan
0       2.1      Flowers         1004    75.00        15       0.2   Feb

**Exercise 64: Join `orders_all` to `returns` on `Order ID` and assign it to `sales`**

In [10]:
sales = returns.merge(orders_all, on='Order ID')
sales.head()

,Number of Records,Order ID,Updated Order Returns,Return ID,Category,Category ID,Sales,Quantity,Discount,Month
0,1,1.1,Inaccurate,R001,Apparels,1001,89.00,2,0.2,Jan
1,10,1.2,Late Delivery,R002,Electronics,1003,65.00,87,0.2,Jan
2,1,1.3,Product Damaged,R003,Cosmetics,1002,272.74,3,0.2,Jan
3,1,1.4,Incorrect Products Delivered,R004,Apparels,1001,3.54,2,0.8,Jan
4,8,1.5,Description Inaccurate,R005,Cosmetics,1002,19.54,3,0.2,Jan

**Exercise 65: Update `users` by joining `sales` to it on `Return ID` and `Category ID`**

In [11]:
users = sales.merge(users, on=['Return ID', 'Category ID'])
users.head()

,Number of Records,Order ID,Updated Order Returns,Return ID,Category,Category ID,Sales,Quantity,Discount,Month,Person,Region
0,1,1.1,Inaccurate,R001,Apparels,1001,89.00,2,0.2,Jan,Perez,East
1,10,1.2,Late Delivery,R002,Electronics,1003,65.00,87,0.2,Jan,Kimi,East
2,1,1.3,Product Damaged,R003,Cosmetics,1002,272.74,3,0.2,Jan,Lando,Central
3,1,1.4,Incorrect Products Delivered,R004,Apparels,1001,3.54,2,0.8,Jan,Amy,West
4,1,1.7,Customer Dissatified With Product,R006,Apparels,1001,12.78,3,0.0,Jan,Isabella,West

**Exercise 66: Display the Categories that had orders in Jan or Mar**

In [12]:
list(set(orders_jan['Category']) | set(orders_mar['Category']))

['Flowers',
 'Cosmetics',
 'Pet Care',
 'Apparels',
 'Electronics',
 'Paper Products\xa0',
 'International Cuisine',
 'Pharmacy']

**Exercise 67: Display the Categories that had orders in each of the three months**

In [13]:
list(set(orders_jan['Category']) & set(orders_feb['Category']) & set(orders_mar['Category']))

[]

**Exercise 68: Display the Categories that had orders only in Jan but not in Feb and Mar**

In [14]:
set(orders_jan['Category']) - set(set(orders_feb['Category']) | set(orders_mar['Category']))

{'Cosmetics', 'Electronics'}

In [15]:
pd.crosstab(orders_all['Category'], orders_all['Month']).T

Category,Apparels,Cosmetics,Electronics,Flowers,Gift cards,Grocery,International Cuisine,Paper Products,Pet Care,Pharmacy
Month,,,,,,,,,,
Feb,0,0,0,1,1,1,1,1,2,2
Jan,5,2,2,0,0,0,0,0,0,0
March,1,0,0,2,0,0,2,2,1,1

**Exercise 69: Display the Categories that had orders in either of the three months but never together**

In [16]:
list(set(orders_jan['Category']) ^ set(orders_feb['Category']) ^ set(orders_mar['Category']))

['Cosmetics', 'Gift cards', 'Electronics', 'Grocery']

**Exercise 70: One-hot encode the column `Region` in `users`, assign it to `ohe_region` and append it back to `users`**

In [17]:
ohe_region = pd.get_dummies(users['Region'], prefix='Region').reset_index(drop=True)
ohe_region.head()

   Region_Central  Region_East  Region_South  Region_West
0               0            1             0            0
1               0            1             0            0
2               1            0             0            0
3               0            0             0            1
4               0            0             0            1

In [18]:
users = pd.concat([users, ohe_region], axis=1)
users.head()

,Number of Records,Order ID,Updated Order Returns,Return ID,Category,Category ID,Sales,Quantity,Discount,Month,Person,Region,Region_Central,Region_East,Region_South,Region_West
0,1,1.1,Inaccurate,R001,Apparels,1001,89.00,2,0.2,Jan,Perez,East,0,1,0,0
1,10,1.2,Late Delivery,R002,Electronics,1003,65.00,87,0.2,Jan,Kimi,East,0,1,0,0
2,1,1.3,Product Damaged,R003,Cosmetics,1002,272.74,3,0.2,Jan,Lando,Central,1,0,0,0
3,1,1.4,Incorrect Products Delivered,R004,Apparels,1001,3.54,2,0.8,Jan,Amy,West,0,0,0,1
4,1,1.7,Customer Dissatified With Product,R006,Apparels,1001,12.78,3,0.0,Jan,Isabella,West,0,0,0,1

✅ This completes Set 7: Multiple Frames (Exercises 61-70)  
Original exercises for Datatable package can be found [here](https://github.com/vopani/datatableton)